{
  "url": "https://idrw.org/iaf-and-drdo-explore-upgrades-for-ageing-phalcon-awacs-amid-push-for-indigenous-innovation/",
  "title": "IAF and DRDO Explore Upgrades for Ageing Phalcon AWACS Amid Push for Indigenous Innovation",
  "author": "By",
  "date": "Published",
  "content": "source raunak kunde  news beat  idrw.org the indian air force iaf and the defence research and development organisation drdo have initiated discussions to modernize the three israeli-supplied elm-2090 aesa phalcon airborne warning and control systems awacs, mounted on russian il-76 a-50ei heavy-lift jets. according to sources cited by idrw.org, the technology underpinning these systems, now over 25 years old, is increasingly viewed as a legacy platform despite regular software updates that have kept it operational as the iafs only 360-degree coverage awacs. the elm-2090 phalcon, delivered to india under a tripartite agreement involving israel, russia, and india in the mid-2000s, has been a critical asset for the iaf, providing comprehensive situational awareness with its active electronically scanned array aesa radar. however, with advancements in radar technology and the evolving needs of modern warfare, the systems capabilities are being outpaced. drdos centre for airborne systems cabs has proposed the netra mkiii, an indigenous awacs based on the airbus a330 platform, which promises significant upgrades, including gallium nitride gan-based technology. this next-generation system is expected to extend the scan range for fighter-sized aircraft to nearly 600 kilometresfar surpassing the phalcons current capabilities. while the phalcon awacs has received periodic software enhancements to maintain its relevance, the hardware itself is rooted in technology from the late 1990s. the iaf relies on these three platforms for long-range surveillance and command-and-control functions, particularly along its contested borders with china and pakistan. however, maintenance challenges with the ageing il-76 airframes, compounded by spares shortages, have added urgency to the upgrade talks. according to idrw.org, the iaf and drdo are exploring two potential paths a local upgrade of the existing elm-2090 radar using indigenous technologies or a complete revamp of the system. the latter could involve replacing the radar with a domestically developed alternative, leveraging drdos growing expertise in aesa radar design, as demonstrated by the netra aewc program. the israeli air force has already transitioned from the elm-2090 to the more advanced elw-2085, a multi-band radar system mounted on the gulfstream g550 conformal airborne early warning caew aircraft. developed from the single-band elm-2075 phalcon, the elw-2085 offers improved performance and lower operational costs compared to the il-76-based system. sources speaking to idrw.org suggest that israel could be approached to propose an upgraded radar for the iafs falcons. however, this option would likely require the iaf to bear the full cost of development and integrationa significant financial commitment that could strain budgets already stretched by other modernization priorities. in contrast, a locally driven upgrade or replacement offers the potential for cost savings and technological sovereignty. drdos experience with the netra mki, mounted on embraer emb-145 jets, and its ongoing work on the netra mkii, demonstrate a maturing capability in airborne surveillance systems. the netra mkii, with its gan-based aesa radar, promises not only a longer detection range but also enhanced resistance to jamming and improved performance against stealth targetsfeatures that could eventually be adapted for the phalcon fleet. despite the pressing need to modernize, the upgrade or replacement of the phalcons main radar is not imminent. sources cited by idrw.org indicate that any program will likely be deferred until drdo successfully demonstrates the netra mkiii on the airbus a330 platform. the a330-based awacs, still in development, is envisioned as a game-changer for the iaf, offering 360-degree coverage, extended endurance, and a scan range that could redefine indias aerial surveillance capabilities. only after this system matures will the iaf and drdo finalize their approach to the phalcon fleet. note article cannot be reproduced without written permission of idrw.org in any form even for youtube videos to avoid copy right strikes. websites doing illegal reproductions will get dmca and legal notices.",
  "summary": "however, with advancements in radar technology and the evolving needs of modern warfare, the systems capabilities are being outpaced. this next-generation system is expected to extend the scan range for fighter-sized aircraft to nearly 600 kilometresfar surpassing the phalcons current capabilities. while the phalcon awacs has received periodic software enhancements to maintain its relevance, the hardware itself is rooted in technology from the late 1990s. org, the iaf and drdo are exploring two potential paths a local upgrade of the existing elm-2090 radar using indigenous technologies or a complete revamp of the system. the latter could involve replacing the radar with a domestically developed alternative, leveraging drdos growing expertise in aesa radar design, as demonstrated by the netra aewc program. the israeli air force has already transitioned from the elm-2090 to the more advanced elw-2085, a multi-band radar system mounted on the gulfstream g550 conformal airborne early warning caew aircraft. developed from the single-band elm-2075 phalcon, the elw-2085 offers improved performance and lower operational costs compared to the il-76-based system. despite the pressing need to modernize, the upgrade or replacement of the phalcons main radar is not imminent. only after this system matures will the iaf and drdo finalize their approach to the phalcon fleet.",
  "keywords": [
    "radar",
    "netra",
    "iaf",
    "could",
    "drdo",
    "aesa",
    "phalcon",
    "airborne",
    "upgrade",
    "have"
  ]
}