[
  {
    "url": "https://idrw.org/iaf-and-drdo-explore-upgrades-for-ageing-phalcon-awacs-amid-push-for-indigenous-innovation/",
    "title": "IAF and DRDO Explore Upgrades for Ageing Phalcon AWACS Amid Push for Indigenous Innovation",
    "content": "",
    "author": "By",
    "date": "Published",
    "metadata": {
      "viewport": "initial-scale = 1.0, maximum-scale = 1.0, user-scalable = no, width = device-width",
      "robots": "max-image-preview:large",
      "msapplication-TileImage": "https://idrw.org/wp-content/uploads/2015/01/cropped-logo-270x270.png"
    },
    "keywords": [],
    "saved_at": "2025-04-25T04:59:10.982663"
  },
  {
    "url": "https://idrw.org/hal-prachand-set-to-boost-firepower-with-indigenous-80mm-unguided-rocket-upgrade/",
    "title": "HAL Prachand Set to Boost Firepower with Indigenous 80mm Unguided Rocket Upgrade",
    "content": "",
    "author": "By",
    "date": "Published",
    "metadata": {
      "viewport": "initial-scale = 1.0, maximum-scale = 1.0, user-scalable = no, width = device-width",
      "robots": "max-image-preview:large",
      "msapplication-TileImage": "https://idrw.org/wp-content/uploads/2015/01/cropped-logo-270x270.png"
    },
    "keywords": [],
    "saved_at": "2025-04-25T04:59:20.765974"
  },
  {
    "url": "https://idrw.org/saabs-gripen-e-offers-seamless-integration-of-indian-missiles-100-tot/",
    "title": "Saab’s Gripen-E offers Seamless Integration of Indian Missiles, 100% ToT",
    "content": "",
    "author": "By",
    "date": "Published",
    "metadata": {
      "viewport": "initial-scale = 1.0, maximum-scale = 1.0, user-scalable = no, width = device-width",
      "robots": "max-image-preview:large",
      "msapplication-TileImage": "https://idrw.org/wp-content/uploads/2015/01/cropped-logo-270x270.png"
    },
    "keywords": [],
    "saved_at": "2025-04-25T04:59:24.763588"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/how-uk-deal-on-diego-garcia-could.html",
    "title": "Indian Strategic Studies",
    "content": "raghvendra kumar source link introduction the context diego garcia , an atoll and one of the largest of the 52 islands in the middle of the indian ocean, is geographically part of the chagos archipelago  a british indian ocean territory biot, which is one of the 14 overseas territories of the united kingdom. however, its sovereignty is contested by mauritius, an african island state in the indian ocean. diego garcia hosts a joint anglo-american military base with a deep-water port capable of berthing aircraft carriers, a long runway that enables deep-strike operations and accommodates heavy bombers and refueling aircraft, advanced satellite communication facilities essential for real-time command and control, and strategically pre-positioned military support and supplies  making it a key node for logistics, surveillance, intelligence, and strategic deterrence for the united states. this military base provides the united states with strategic depth and tactical command to project power far beyond its territorial boundaries into regions designated as primary areas of national interest by washington  as witnessed during the gulf war 1991, the war on terror and the invasion of afghanistan 20012021, the iraq invasion 2003, and, most recently, the us strikes on houthi rebels in yemen. since 15 march 2025 , the united states has launched relentless airstrikes on houthi rebel hideouts in yemen, responding to their continued disruption of the free passage of cargo, commercial shipping, and energy supplies in the red sea region. operating in coordination with hezbollah and backed by state-sponsored support, the houthis have increasingly weaponized advanced technologies  including drones, missiles, and unmanned surface vessels usvs  to threaten vital maritime trade routes. these developments have not only jeopardized us and global interests but also pose serious ramifications for regional security, as state-sponsored non-state actors gain access to sophisticated weapon systems capable of holding critical infrastructure and sea lanes hostage  thereby acquiring the means to destabilize the entire region and turning it into a potential safe haven for transnational organized crime networks tnoc.",
    "author": "Maj Gen P K Mallick, VSM(Retd)",
    "date": null,
    "metadata": {
      "viewport": "width=1100",
      "generator": "blogger",
      "og:url": "https://www.strategicstudyindia.com/2025/04/how-uk-deal-on-diego-garcia-could.html",
      "og:title": "How the U.K. Deal on Diego Garcia Could Reshape U.S. Military in the Indian Ocean",
      "og:description": "The Indian  Strategic Study uploads 30  papers of current strategic issues everyday covering China, Asia, Europe, CAR, Technology, Military Matters,",
      "twitter:card": "summary",
      "twitter:site": "@dadamallick",
      "twitter:title": "Indian Strategic Studies",
      "twitter:description": "This website uploads 30 papers on strategic issues published all over the world in the last 48 hours.",
      "twitter:image": "https://indianstrategicknowledgeonline.com/strategicstudylogo.jpg",
      "google-adsense-platform-account": "ca-host-pub-1556223355139109",
      "google-adsense-platform-domain": "blogspot.com"
    },
    "keywords": [
      "united",
      "indian",
      "military",
      "diego",
      "garcia"
    ],
    "summary": "raghvendra kumar source link introduction the context diego garcia , an atoll and one of the largest of the 52 islands in the middle of the indian ocean, is geographically part of the chagos archipelago a british indian ocean territory biot, which is one of the 14 overseas territories of the united kingdom. however, its sovereignty is contested by mauritius, an african island state in the indian ocean. this military base provides the united states with strategic depth and tactical command to project power far beyond its territorial boundaries into regions designated as primary areas of national interest by washington as witnessed during the gulf war 1991, the war on terror and the invasion of afghanistan 20012021, the iraq invasion 2003, and, most recently, the us strikes on houthi rebels in yemen.",
    "saved_at": "2025-04-25T05:00:28.547010"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/se-asia-keeps-peace-50-years-after.html",
    "title": "Indian Strategic Studies",
    "content": "michael vatikiotis source link on april 30, 1975, the last american helicopter lifted off the roof of the us embassy in saigon hours before north vietnamese tanks crashed through the gates of then-south vietnams presidential palace, marking the end of the vietnam war. since then, southeast asia has been mostly unafflicted by interstate war. there was, of course, vietnams invasion of cambodia in december 1978 and chinas retaliatory assault on vietnam along their shared border months later in 1979. but these were largely legacies of indochinas larger conflict that started when france sought to defeat vietnams bid for independence in the 1950s. the lesson of this period half a century ago, which cost as many as four million lives, is that great powers were militarily defeated and failed to prevail. southeast asian states, although riven by internal tension and conflict, have since then managed to fend off external intrusion and coexist in awkward though peaceful equilibrium. this signifies a historical resilience and immunity that, in todays era of multipolarity and evolving spheres of influence, should serve southeast asia well. as other regions of the world fall prey to proxy conflict and perpetual instability  particularly the middle east  the ten nations of southeast asia have managed to resist overt great power alignment and enjoy relative geopolitical stability.",
    "author": "Maj Gen P K Mallick, VSM(Retd)",
    "date": null,
    "metadata": {
      "viewport": "width=1100",
      "generator": "blogger",
      "og:url": "https://www.strategicstudyindia.com/2025/04/se-asia-keeps-peace-50-years-after.html",
      "og:title": "SE Asia keeps the peace 50 years after Vietnam War",
      "og:description": "The Indian  Strategic Study uploads 30  papers of current strategic issues everyday covering China, Asia, Europe, CAR, Technology, Military Matters,",
      "twitter:card": "summary",
      "twitter:site": "@dadamallick",
      "twitter:title": "Indian Strategic Studies",
      "twitter:description": "This website uploads 30 papers on strategic issues published all over the world in the last 48 hours.",
      "twitter:image": "https://indianstrategicknowledgeonline.com/strategicstudylogo.jpg",
      "google-adsense-platform-account": "ca-host-pub-1556223355139109",
      "google-adsense-platform-domain": "blogspot.com"
    },
    "keywords": [
      "southeast",
      "vietnams",
      "asia",
      "off",
      "vietnam"
    ],
    "summary": "michael vatikiotis source link on april 30, 1975, the last american helicopter lifted off the roof of the us embassy in saigon hours before north vietnamese tanks crashed through the gates of then-south vietnams presidential palace, marking the end of the vietnam war. this signifies a historical resilience and immunity that, in todays era of multipolarity and evolving spheres of influence, should serve southeast asia well. as other regions of the world fall prey to proxy conflict and perpetual instability particularly the middle east the ten nations of southeast asia have managed to resist overt great power alignment and enjoy relative geopolitical stability.",
    "saved_at": "2025-04-25T05:00:36.166679"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/shattered-hegemony-rivalry-between-us.html",
    "title": "Indian Strategic Studies",
    "content": "josé juan ruiz source link 1. introduction for decades, the international system was characterised by the hegemonic position of the us, consolidated after world war ii and strengthened after the disintegration of the soviet union in 1991. however, chinas re-emergence as a key player in the worlds economic, political and military dynamics has started to challenge us primacy, something that began to become evident in donald trumps first administration in 2017 and has intensified since his return to the white house. in the few months that have elapsed since his return to power, there has been a radical change compared with previous administrations, both in terms of rhetoric and in terms of economic and foreign policy. his protectionist policies, his withdrawal from global commitments and the imposition of tariffs on allies and rivals have caused acute uncertainty, while his foreign policy decisions have become increasingly reminiscent of the gunboat diplomacy of the 19th century.",
    "author": "Maj Gen P K Mallick, VSM(Retd)",
    "date": null,
    "metadata": {
      "viewport": "width=1100",
      "generator": "blogger",
      "og:url": "https://www.strategicstudyindia.com/2025/04/shattered-hegemony-rivalry-between-us.html",
      "og:title": "Shattered Hegemony: Rivalry Between US And China In New Era Of Politics Of Force – Analysis",
      "og:description": "The Indian  Strategic Study uploads 30  papers of current strategic issues everyday covering China, Asia, Europe, CAR, Technology, Military Matters,",
      "twitter:card": "summary",
      "twitter:site": "@dadamallick",
      "twitter:title": "Indian Strategic Studies",
      "twitter:description": "This website uploads 30 papers on strategic issues published all over the world in the last 48 hours.",
      "twitter:image": "https://indianstrategicknowledgeonline.com/strategicstudylogo.jpg",
      "google-adsense-platform-account": "ca-host-pub-1556223355139109",
      "google-adsense-platform-domain": "blogspot.com"
    },
    "keywords": [
      "his",
      "have",
      "after",
      "become",
      "since"
    ],
    "summary": "introduction for decades, the international system was characterised by the hegemonic position of the us, consolidated after world war ii and strengthened after the disintegration of the soviet union in 1991. in the few months that have elapsed since his return to power, there has been a radical change compared with previous administrations, both in terms of rhetoric and in terms of economic and foreign policy. his protectionist policies, his withdrawal from global commitments and the imposition of tariffs on allies and rivals have caused acute uncertainty, while his foreign policy decisions have become increasingly reminiscent of the gunboat diplomacy of the 19th century.",
    "saved_at": "2025-04-25T05:00:42.928895"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/how-uk-deal-on-diego-garcia-could.html",
    "title": "How the U.K. Deal on Diego Garcia Could Reshape U.S. Military in the Indian Ocean",
    "content": "",
    "author": null,
    "date": null,
    "metadata": {},
    "cleaned_content": "",
    "keywords": [],
    "summary": "",
    "stats": {
      "num_sentences": 0,
      "num_words": 0,
      "avg_sentence_length": 0,
      "reading_time": 1
    },
    "summary_stats": {
      "original_length": 0,
      "summary_length": 0,
      "compression_ratio": 0,
      "original_reading_time": 1,
      "summary_reading_time": 1
    },
    "saved_at": "2025-04-25T05:03:11.767334"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/se-asia-keeps-peace-50-years-after.html",
    "title": "SE Asia keeps the peace 50 years after Vietnam War",
    "content": "",
    "author": null,
    "date": null,
    "metadata": {},
    "cleaned_content": "",
    "keywords": [],
    "summary": "",
    "stats": {
      "num_sentences": 0,
      "num_words": 0,
      "avg_sentence_length": 0,
      "reading_time": 1
    },
    "summary_stats": {
      "original_length": 0,
      "summary_length": 0,
      "compression_ratio": 0,
      "original_reading_time": 1,
      "summary_reading_time": 1
    },
    "saved_at": "2025-04-25T05:03:18.797291"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/shattered-hegemony-rivalry-between-us.html",
    "title": "Shattered Hegemony: Rivalry Between US And China In New Era Of Politics Of Force – Analysis",
    "content": "",
    "author": null,
    "date": null,
    "metadata": {},
    "cleaned_content": "",
    "keywords": [],
    "summary": "",
    "stats": {
      "num_sentences": 0,
      "num_words": 0,
      "avg_sentence_length": 0,
      "reading_time": 1
    },
    "summary_stats": {
      "original_length": 0,
      "summary_length": 0,
      "compression_ratio": 0,
      "original_reading_time": 1,
      "summary_reading_time": 1
    },
    "saved_at": "2025-04-25T05:03:26.726045"
  },
  {
    "url": "https://www.strategicstudyindia.com/2025/04/how-uk-deal-on-diego-garcia-could.html",
    "title": "How the U.K. Deal on Diego Garcia Could Reshape U.S. Military in the Indian Ocean",
    "content": "",
    "author": null,
    "date": null,
    "metadata": {},
    "cleaned_content": "",
    "keywords": [],
    "summary": "",
    "stats": {
      "num_sentences": 0,
      "num_words": 0,
      "avg_sentence_length": 0,
      "reading_time": 1
    },
    "summary_stats": {
      "original_length": 0,
      "summary_length": 0,
      "compression_ratio": 0,
      "original_reading_time": 1,
      "summary_reading_time": 1
    },
    "saved_at": "2025-04-25T05:22:08.495572"
  },
  {
    "url": "https://idrw.org/iaf-and-drdo-explore-upgrades-for-ageing-phalcon-awacs-amid-push-for-indigenous-innovation/",
    "title": "IAF and DRDO Explore Upgrades for Ageing Phalcon AWACS Amid Push for Indigenous Innovation",
    "content": "SOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORG\n\nThe Indian Air Force (IAF) and the Defence Research and Development Organisation (DRDO) have initiated discussions to modernize the three Israeli-supplied EL/M-2090 AESA Phalcon Airborne Warning and Control Systems (AWACS), mounted on Russian IL-76 A-50E/I heavy-lift jets.\n\nAccording to sources cited by idrw.org, the technology underpinning these systems, now over 25 years old, is increasingly viewed as a legacy platform despite regular software updates that have kept it operational as the IAF’s only 360-degree coverage AWACS.\n\nThe EL/M-2090 Phalcon, delivered to India under a tripartite agreement involving Israel, Russia, and India in the mid-2000s, has been a critical asset for the IAF, providing comprehensive situational awareness with its Active Electronically Scanned Array (AESA) radar. However, with advancements in radar technology and the evolving needs of modern warfare, the system’s capabilities are being outpaced.\n\nDRDO’s Centre for Airborne Systems (CABS) has proposed the Netra MkIII, an indigenous AWACS based on the Airbus A330 platform, which promises significant upgrades, including Gallium Nitride (GaN)-based technology. This next-generation system is expected to extend the scan range for fighter-sized aircraft to nearly 600 kilometres—far surpassing the Phalcon’s current capabilities.\n\nWhile the Phalcon AWACS has received periodic software enhancements to maintain its relevance, the hardware itself is rooted in technology from the late 1990s. The IAF relies on these three platforms for long-range surveillance and command-and-control functions, particularly along its contested borders with China and Pakistan. However, maintenance challenges with the ageing IL-76 airframes, compounded by spares shortages, have added urgency to the upgrade talks.\n\nAccording to idrw.org, the IAF and DRDO are exploring two potential paths: a local upgrade of the existing EL/M-2090 radar using indigenous technologies or a complete revamp of the system. The latter could involve replacing the radar with a domestically developed alternative, leveraging DRDO’s growing expertise in AESA radar design, as demonstrated by the Netra AEW&C program.\n\nThe Israeli Air Force has already transitioned from the EL/M-2090 to the more advanced EL/W-2085, a multi-band radar system mounted on the Gulfstream G550 Conformal Airborne Early Warning (CAEW) aircraft. Developed from the single-band EL/M-2075 Phalcon, the EL/W-2085 offers improved performance and lower operational costs compared to the IL-76-based system. Sources speaking to idrw.org suggest that Israel could be approached to propose an upgraded radar for the IAF’s Falcons. However, this option would likely require the IAF to bear the full cost of development and integration—a significant financial commitment that could strain budgets already stretched by other modernization priorities.\n\nIn contrast, a locally driven upgrade or replacement offers the potential for cost savings and technological sovereignty. DRDO’s experience with the Netra MkI, mounted on Embraer EMB-145 jets, and its ongoing work on the Netra MkII, demonstrate a maturing capability in airborne surveillance systems. The Netra MkII, with its GaN-based AESA radar, promises not only a longer detection range but also enhanced resistance to jamming and improved performance against stealth targets—features that could eventually be adapted for the Phalcon fleet.\n\nDespite the pressing need to modernize, the upgrade or replacement of the Phalcon’s main radar is not imminent. Sources cited by idrw.org indicate that any program will likely be deferred until DRDO successfully demonstrates the Netra MkIII on the Airbus A330 platform. The A330-based AWACS, still in development, is envisioned as a game-changer for the IAF, offering 360-degree coverage, extended endurance, and a scan range that could redefine India’s aerial surveillance capabilities. Only after this system matures will the IAF and DRDO finalize their approach to the Phalcon fleet.\n\nNOTE: Article cannot be reproduced without written permission of idrw.org in any form even for YouTube Videos to avoid Copy right strikes. Websites doing illegal reproductions will get DMCA and Legal Notices.",
    "author": "By",
    "date": "Published",
    "metadata": {},
    "cleaned_content": "source raunak kunde  news beat  idrw.org the indian air force iaf and the defence research and development organisation drdo have initiated discussions to modernize the three israeli-supplied elm-2090 aesa phalcon airborne warning and control systems awacs, mounted on russian il-76 a-50ei heavy-lift jets. according to sources cited by idrw.org, the technology underpinning these systems, now over 25 years old, is increasingly viewed as a legacy platform despite regular software updates that have kept it operational as the iafs only 360-degree coverage awacs. the elm-2090 phalcon, delivered to india under a tripartite agreement involving israel, russia, and india in the mid-2000s, has been a critical asset for the iaf, providing comprehensive situational awareness with its active electronically scanned array aesa radar. however, with advancements in radar technology and the evolving needs of modern warfare, the systems capabilities are being outpaced. drdos centre for airborne systems cabs has proposed the netra mkiii, an indigenous awacs based on the airbus a330 platform, which promises significant upgrades, including gallium nitride gan-based technology. this next-generation system is expected to extend the scan range for fighter-sized aircraft to nearly 600 kilometresfar surpassing the phalcons current capabilities. while the phalcon awacs has received periodic software enhancements to maintain its relevance, the hardware itself is rooted in technology from the late 1990s. the iaf relies on these three platforms for long-range surveillance and command-and-control functions, particularly along its contested borders with china and pakistan. however, maintenance challenges with the ageing il-76 airframes, compounded by spares shortages, have added urgency to the upgrade talks. according to idrw.org, the iaf and drdo are exploring two potential paths a local upgrade of the existing elm-2090 radar using indigenous technologies or a complete revamp of the system. the latter could involve replacing the radar with a domestically developed alternative, leveraging drdos growing expertise in aesa radar design, as demonstrated by the netra aewc program. the israeli air force has already transitioned from the elm-2090 to the more advanced elw-2085, a multi-band radar system mounted on the gulfstream g550 conformal airborne early warning caew aircraft. developed from the single-band elm-2075 phalcon, the elw-2085 offers improved performance and lower operational costs compared to the il-76-based system. sources speaking to idrw.org suggest that israel could be approached to propose an upgraded radar for the iafs falcons. however, this option would likely require the iaf to bear the full cost of development and integrationa significant financial commitment that could strain budgets already stretched by other modernization priorities. in contrast, a locally driven upgrade or replacement offers the potential for cost savings and technological sovereignty. drdos experience with the netra mki, mounted on embraer emb-145 jets, and its ongoing work on the netra mkii, demonstrate a maturing capability in airborne surveillance systems. the netra mkii, with its gan-based aesa radar, promises not only a longer detection range but also enhanced resistance to jamming and improved performance against stealth targetsfeatures that could eventually be adapted for the phalcon fleet. despite the pressing need to modernize, the upgrade or replacement of the phalcons main radar is not imminent. sources cited by idrw.org indicate that any program will likely be deferred until drdo successfully demonstrates the netra mkiii on the airbus a330 platform. the a330-based awacs, still in development, is envisioned as a game-changer for the iaf, offering 360-degree coverage, extended endurance, and a scan range that could redefine indias aerial surveillance capabilities. only after this system matures will the iaf and drdo finalize their approach to the phalcon fleet. note article cannot be reproduced without written permission of idrw.org in any form even for youtube videos to avoid copy right strikes. websites doing illegal reproductions will get dmca and legal notices.",
    "keywords": [
      "radar",
      "netra",
      "iaf",
      "could",
      "drdo"
    ],
    "summary": "however, with advancements in radar technology and the evolving needs of modern warfare, the systems capabilities are being outpaced. this next-generation system is expected to extend the scan range for fighter-sized aircraft to nearly 600 kilometresfar surpassing the phalcons current capabilities. while the phalcon awacs has received periodic software enhancements to maintain its relevance, the hardware itself is rooted in technology from the late 1990s. org, the iaf and drdo are exploring two potential paths a local upgrade of the existing elm-2090 radar using indigenous technologies or a complete revamp of the system. the latter could involve replacing the radar with a domestically developed alternative, leveraging drdos growing expertise in aesa radar design, as demonstrated by the netra aewc program. the israeli air force has already transitioned from the elm-2090 to the more advanced elw-2085, a multi-band radar system mounted on the gulfstream g550 conformal airborne early warning caew aircraft. developed from the single-band elm-2075 phalcon, the elw-2085 offers improved performance and lower operational costs compared to the il-76-based system. despite the pressing need to modernize, the upgrade or replacement of the phalcons main radar is not imminent. only after this system matures will the iaf and drdo finalize their approach to the phalcon fleet.",
    "stats": {
      "num_sentences": 30,
      "num_words": 612,
      "avg_sentence_length": 20.4,
      "reading_time": 3
    },
    "summary_stats": {
      "original_length": 612,
      "summary_length": 205,
      "compression_ratio": 0.3349673202614379,
      "original_reading_time": 3,
      "summary_reading_time": 1
    },
    "saved_at": "2025-04-25T05:23:25.652947"
  }
]